<!-- dflook/terraform-github-actions {"workspace":"auto-json-2","backend_type":"remote","backend":"89c598f38d20eea928847d49e2499eac7e3b8c39351fe2b33f80c3dea10bd8f6","plan_job_ref":"Job Test Terraform cloud #337 at https://github.com/dflook/terraform-github-actions/actions/runs/15425302038","plan_hash":"166a11326fa50e6a318897b6dc4db4c0b800f2eab404f55d7068fc615551f0f7","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/0.13__ in the __auto-json-2__ workspace
With var files: `tests/workflows/test-cloud/0.13/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.the_id will be created
+   resource "random_id" "the_id" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 5
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:orange_circle: Applying plan in [Test Terraform cloud #337](https://github.com/dflook/terraform-github-actions/actions/runs/15425302038)